/* Done Button for closing the mini browser */
"i18N_YMB_Done_Button" = "Terminat";

/* Pop up menu action label */
"i18N_YMB_Search_Popup_Label" = "Căutare";

/* Open in safari action label */
"i18N_YMB_Share_Action_Open_in_Safari" = "Deschidere în Safari";

/* Browser Back accessibility label */
"i18N_YMB_back_access_label" = "Reveniţi.";

/* Browser Back accessibility hint */
"i18N_YMB_back_access_hint" = "Atingeţi dublu pentru a reveni la pagina web anterioară.";

/* Browser share button accessibility label */
"i18N_YMB_share_access_label" = "Partajaţi.";
